; domain
(define (domain exercise0)
  (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality)

  (:types robot location object)

  (:predicates
    (at-robot ?r - robot ?loc - location)
    (at-object ?o - object ?loc - location)
    (holding ?r - robot ?o - object)
  )

  (:action move
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (at-robot ?r ?from) (not (= ?from ?to)))
    :effect (and (not (at-robot ?r ?from)) (at-robot ?r ?to))
  )

  (:action pick_up
    :parameters (?r - robot ?o - object ?loc - location)
    :precondition (and (at-robot ?r ?loc) (at-object ?o ?loc))
    :effect (and (not (at-object ?o ?loc)) (holding ?r ?o))
  )

  (:action put_down
    :parameters (?r - robot ?o - object ?loc - location)
    :precondition (and (holding ?r ?o) (at-robot ?r ?loc))
    :effect (and (not (holding ?r ?o)) (at-object ?o ?loc))
  )
)

; problem
(define (problem basic-manipulation-test)
  (:domain exercise0)

  (:objects
    robot1 - robot

    start target - location

    attc1 attc2 attc3 attc4 - object
  )

  (:init
    ;; posição inicial do robô
    (at-robot robot1 start)

    ;; os quatro objetos começam na área inicial
    (at-object attc1 start)
    (at-object attc2 start)
    (at-object attc3 start)
    (at-object attc4 start)
  )

  (:goal
    (and
      ;; apenas três objetos precisam ser transportados
      (at-object attc1 target)
      (at-object attc2 target)
      (at-object attc3 target)
    )
  )
)

; plan
1. (pick_up robot1 attc3 start)
   deleted: (at-object attc3 start)
   added: (holding robot1 attc3)
   goals met: 0 of 3
2. (pick_up robot1 attc2 start)
   deleted: (at-object attc2 start)
   added: (holding robot1 attc2)
   goals met: 0 of 3
3. (pick_up robot1 attc1 start)
   deleted: (at-object attc1 start)
   added: (holding robot1 attc1)
   goals met: 0 of 3
4. (move robot1 start target)
   deleted: (at-robot robot1 start)
   added: (at-robot robot1 target)
   goals met: 0 of 3
5. (put_down robot1 attc3 target)
   deleted: (holding robot1 attc3)
   added: (at-object attc3 target)
   goals met: 1 of 3
6. (put_down robot1 attc2 target)
   deleted: (holding robot1 attc2)
   added: (at-object attc2 target)
   goals met: 2 of 3
7. (put_down robot1 attc1 target)
   deleted: (holding robot1 attc1)
   added: (at-object attc1 target)
   goals met: 3 of 3
